{"6e7c1b6e1a005fff15b9c3303874e34a":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"df6b81d441391d32","status":"passed","time":{"start":1727783020701,"stop":1727783021100,"duration":399}}]},"6cb45cc9546a01bbb0e660cd91090ab6":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"408eb96b48219ed3","status":"passed","time":{"start":1727783064043,"stop":1727783070056,"duration":6013}}]},"63dd1129ef23ae2bfa8135880eca86dc":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"415504ee751eebb2","status":"passed","time":{"start":1727783025282,"stop":1727783027603,"duration":2321}}]},"d2d1fc593147f2826da04161bbd2c95a":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"496235c4f1cce9e3","status":"failed","statusDetails":"Cannot update author by negative Id expected [400] but found [200]","time":{"start":1727783083224,"stop":1727783083567,"duration":343}}]},"a6802f1721909bfdc214790f86d34c66":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"4e4b34d06d26e808","status":"passed","time":{"start":1727783050646,"stop":1727783051010,"duration":364}}]},"96fcbd2d86f3db78ac30420afe53e234":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"421106fcbb37efb5","status":"failed","statusDetails":"Author shouldn't have empty fields expected [400] but found [200]","time":{"start":1727783051012,"stop":1727783051333,"duration":321}}]},"38fbe0fca071022ef6eecdff197b7755":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"1461212b02f8eeb3","status":"failed","statusDetails":"Should not be able to create an author with non-existence Book Id expected [400] but found [200]","time":{"start":1727783052009,"stop":1727783054443,"duration":2434}}]},"893ba3cdd8bb4f5eb8e9ab4be223a4c1":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"fb99beab836c001c","status":"passed","time":{"start":1727783028736,"stop":1727783030623,"duration":1887}}]},"75d7bb9e6df5f17ad8724958308f2738":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"c70ee3ea0741946e","status":"passed","time":{"start":1727783070058,"stop":1727783071053,"duration":995}}]},"66a4335b6707e91c941994755e45a106":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"82ecf17dfd89dc38","status":"failed","statusDetails":"\nMultiple Failures (2 failures)\n-- failure 1 --\n[Code Status should be equal to: 404] \nexpected: 404\n but was: 200\nat VerifyDeleteAuthorAPITest.lambda$deleteExistingAuthorTest$0(VerifyDeleteAuthorAPITest.java:30)\n-- failure 2 --\n[Author should be deleted] \nexpected: \"Not Found\"\n but was: null\nat VerifyDeleteAuthorAPITest.lambda$deleteExistingAuthorTest$0(VerifyDeleteAuthorAPITest.java:33)","time":{"start":1727783119550,"stop":1727783126729,"duration":7179}}]},"387b4e3bd6ae8dbc47ac1c23f924077b":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"8915433c98af2c65","status":"failed","statusDetails":"\nMultiple Failures (2 failures)\n-- failure 1 --\n[Author First Name should be updated: New Burma] \nexpected: \"New Burma\"\n but was: \"First Name 469\"\nat VerifyPutAuthorAPITest.lambda$updateSingleFieldTest$1(VerifyPutAuthorAPITest.java:77)\n-- failure 2 --\n[Author should be updated in the DB] \nexpected: Author(id=469, idBook=157, firstName=First Name 469, lastName=Last Name 469)\n but was: Author(id=469, idBook=155, firstName=First Name 469, lastName=Last Name 469)\nat VerifyPutAuthorAPITest.lambda$updateSingleFieldTest$1(VerifyPutAuthorAPITest.java:80)","time":{"start":1727783104262,"stop":1727783111400,"duration":7138}}]},"5ab90a44f94dcb6ccbfb3bc672c7d843":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"7e21c1a4a5f5c73d","status":"failed","statusDetails":"Cannot delete author with non-existent Id expected [404] but found [200]","time":{"start":1727783126732,"stop":1727783133372,"duration":6640}}]},"fa90f81fe1f722e06cf22e3f6de967f0":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"de7dea31ee857ff7","status":"failed","statusDetails":"Cannot delete book with negative Id expected [404] but found [200]","time":{"start":1727783035352,"stop":1727783035671,"duration":319}}]},"67609e6c0427d2524e9bdf0e0768f58b":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"795b7740b23d9c23","status":"passed","time":{"start":1727783063709,"stop":1727783064042,"duration":333}}]},"d9fe9c1a59e3bb51f881971ce4f13c59":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"c544365bbaba6365","status":"passed","time":{"start":1727783024807,"stop":1727783025281,"duration":474}}]},"b11e9058b72805fe33a86839a4e27ef9":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"b1dd5879e2db55b6","status":"failed","statusDetails":"\nMultiple Failures (2 failures)\n-- failure 1 --\n[Code Status should be equal to: 404] \nexpected: 404\n but was: 200\nat VerifyDeleteBookAPITest.lambda$deleteExistingBookTest$0(VerifyDeleteBookAPITest.java:30)\n-- failure 2 --\n[Book should be deleted] \nexpected: \"Not Found\"\n but was: \"Book 7\"\nat VerifyDeleteBookAPITest.lambda$deleteExistingBookTest$0(VerifyDeleteBookAPITest.java:33)","time":{"start":1727783036721,"stop":1727783039766,"duration":3045}}]},"8a342745c9eecce3779e6826b92debf1":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"1d1a5f60d00ad45c","status":"failed","statusDetails":"Author doesn't exist expected [404] but found [200]","time":{"start":1727783097529,"stop":1727783104260,"duration":6731}}]},"7203dc80440596002d86389d3f18c90b":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"5afd790611c3aef6","status":"passed","time":{"start":1727783035673,"stop":1727783036719,"duration":1046}}]},"52341f955e675aac052e35df26bec636":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"ab5a31c94c072e0b","status":"passed","time":{"start":1727783027606,"stop":1727783028734,"duration":1128}}]},"bb5fbfb0a0bc2df3ceaad78aa09bb119":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"5baa0232e9a8ebf","status":"passed","time":{"start":1727783044397,"stop":1727783045063,"duration":666}}]},"21f87b61eefd2f53927eb2685121b84b":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"89df404308c5e7b","status":"passed","time":{"start":1727783056836,"stop":1727783057169,"duration":333}}]},"8ce334806a5d479f9557860899e21250":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"84c938f172a0b15c","status":"passed","time":{"start":1727783021836,"stop":1727783024804,"duration":2968}}]},"ab2cac11b61ef9edc0cf886cad58238b":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"36743b8f79cc1747","status":"failed","statusDetails":"Book should be deleted expected [204] but found [200]","time":{"start":1727783032466,"stop":1727783035350,"duration":2884}}]},"315520d7fe1134dcb96813d22f44ef48":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"9bce3623b04afe77","status":"passed","time":{"start":1727783054445,"stop":1727783056835,"duration":2390}}]},"ca5b4e01d48b4d48b532d2f49ab4fa60":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"6837e2bd22381111","status":"failed","statusDetails":"\nMultiple Failures (2 failures)\n-- failure 1 --\n[Book Title should be updated: New All the King's Men] \nexpected: \"New All the King's Men\"\n but was: \"Book 172\"\nat VerifyPutBookAPITest.lambda$updateSingleFieldTest$1(VerifyPutBookAPITest.java:79)\n-- failure 2 --\n[Book should be updated in the DB] \nexpected: \n  Book(id=172, title=Book 172, description=Dolor tation dolor erat justo illum sed est. Et dolore facer no zzril vero erat kasd invidunt sed te eirmod nonumy sit dolores augue. Elitr et vero assum gubergren no tation est magna at et eos lorem duo at diam eos. Tempor takimata autem ut clita amet aliquyam facilisi at nobis nibh ipsum dolor ipsum sanctus takimata invidunt commodo dignissim. Sadipscing ut ipsum. In et sadipscing stet. Eum eirmod eirmod accusam volutpat aliquyam diam.\n  , pageCount=17200, excerpt=Nulla stet soluta. Sed iriure delenit nonumy eos suscipit et sea ipsum. Aliquyam sanctus dolor ut dolore nonumy ipsum no autem ut. Ipsum molestie vel in te illum ea sea takimata nulla illum. Wisi mazim duo. Sea vulputate euismod vero accusam tempor duo et molestie gubergren enim ut cum dolor. Facilisi eirmod elitr eirmod ullamcorper nonumy sed. Diam consequat erat ea labore accusam lorem diam dolore sit dignissim sanctus diam consetetur lorem sanctus. Delenit at ex eros sadipscing ad commodo magna sanctus magna ad elitr amet magna gubergren. Magna vero et sit gubergren velit consetetur. Lobortis dolore ipsum. Feugait amet invidunt vel sit amet takimata labore molestie. Dolor sadipscing dolor consetetur vulputate iriure consetetur accusam sit. Sed est te labore facilisis at rebum adipiscing at id tempor lorem diam sed. Volutpat et ipsum. Rebum eu hendrerit. Vero sed nonumy kasd no clita invidunt suscipit. Eirmod gubergren odio et dolore no nonummy in kasd imperdiet at eos consetetur diam et praesent consetetur sea commodo.\n  Ipsum ipsum aliquyam elitr diam et duo ut nulla tempor rebum dolor at voluptua eos vero. Tation praesent magna est ipsum diam invidunt. Dolor et sanctus duo magna ad nam veniam sea. Augue magna sadipscing stet stet velit quis dignissim at. Labore sed stet. Nibh justo ut sadipscing lorem quod diam. Sadipscing et esse est diam tempor mazim magna vel tempor nonummy vulputate diam luptatum nonumy ipsum. Accusam elitr gubergren molestie dolor amet ex elitr accusam sea duo vel aliquyam te eos in. Voluptua eum erat justo et. Option et invidunt sed. Amet clita sit aliquip. Diam nobis autem ex sit dolor gubergren dolor sed sed ipsum.\n  Lobortis dolor lorem takimata. Diam aliquyam at eirmod consetetur sanctus sed ut. Ea clita est aliquyam sit invidunt qui labore sadipscing quis. Aliquyam ea sit commodo duo sanctus nonumy dolores et. No sit amet consetetur dolor amet no luptatum et. Sit ipsum eos molestie rebum magna diam sed sit erat lorem labore ipsum nonumy vero. At et velit rebum iriure. Eleifend nostrud commodo eu et lorem amet in voluptua. Lorem et ut et erat et option consetetur velit id consequat takimata tation stet et. Gubergren blandit est ipsum praesent nulla amet. Nonumy dolor ea rebum vulputate nihil adipiscing eos at eirmod sadipscing.\n  Et amet euismod molestie. Aliquyam dolor euismod rebum duo at iusto kasd diam amet. Et amet sed ut sit dolore clita. Te ad et eum gubergren sed aliquyam diam dolor ipsum dolores dolore dolor. Lobortis duis quis stet no dolores est adipiscing justo ut no clita labore euismod erat et labore. Tincidunt kasd ipsum. Justo suscipit stet tation sanctus eu. Ad amet ipsum kasd amet sed at vero tincidunt diam et illum et ea. Sit dolor eum accusam sed clita consetetur tempor exerci amet aliquyam erat sanctus luptatum et nonumy nonummy elitr. Stet vero duis enim duo nibh dolor eos sadipscing in lorem enim takimata autem sanctus dolor adipiscing quod sea. Labore duis eos tempor ipsum clita dolore aliquam consetetur delenit. Dolor kasd voluptua justo no accusam labore et possim eirmod duis. Lobortis vel feugait ullamcorper id esse gubergren dolor ea sed. Ex consequat elitr magna justo amet. Et dolore amet duo sea justo aliquam rebum sed. At duis sed vel. Sanctus accumsan iriure tempor ut et erat.\n  Nulla at nulla no diam ipsum assum lorem sea accumsan magna dolor lorem molestie nonumy vel assum. Justo molestie et dolore ea et praesent ad erat dolores clita odio dolor sed et. Eirmod velit ea sea eirmod amet blandit amet sit sit ea et et feugiat diam labore nonumy. Ut duo accusam gubergren accusam tempor luptatum augue ea tempor ex ipsum hendrerit justo veniam dolor. Et lorem option nostrud lorem erat consequat. Aliquyam et et voluptua delenit nostrud sed consetetur kasd amet aliquyam ut dolor laoreet consetetur. Vel duo tempor. Ut ea amet vero feugait takimata id magna ipsum takimata clita ipsum sadipscing takimata mazim sadipscing.\n  , publishDate=2024-04-12T11:44:09.8017354+00:00)\n but was: \n  Book(id=172, title=Book 172, description=Ipsum voluptua et eu aliquip quis consequat sit diam et ut clita consequat hendrerit voluptua nonumy no nulla. Kasd rebum voluptua consectetuer ipsum ea et justo dolor consetetur feugiat. Vulputate sed lorem iusto elitr dolores ipsum exerci euismod nulla tempor eirmod eirmod duis et. Sed diam sed dolore voluptua. Amet nibh liber ea justo vero. Lobortis volutpat aliquyam. Aliquyam sed soluta aliquyam duo minim invidunt placerat zzril magna in stet dolore sadipscing doming diam et at molestie. Sit dolor lorem sea iriure sadipscing dolor sea autem kasd at lorem sea. Eum diam sea vulputate stet takimata facilisis ex dolore kasd et gubergren at at luptatum nulla. Clita id rebum soluta nulla volutpat dolores. Justo lobortis in. Aliquam sanctus sadipscing quis sit eirmod eirmod gubergren nonumy. Veniam dolor aliquyam diam diam eos amet. Nulla ipsum elitr erat sadipscing lobortis vel est ipsum wisi ut. Ipsum et eum adipiscing eirmod volutpat et gubergren duo magna sanctus consetetur iusto vero dolore no vero. Feugiat est sadipscing duis ea sed.\n  , pageCount=17200, excerpt=Nulla dignissim nonumy quod amet nulla. Dolor no sed accumsan diam. Laoreet magna clita aliquyam et takimata vero. Eirmod sed diam aliquyam vulputate at delenit et eos amet. Ut ipsum amet duis dolore sed sed sit clita diam duo. In luptatum lobortis sed amet sea vero. Sed amet sadipscing dolor dolor et sanctus dolore enim. Elit labore gubergren sed lorem duo accusam velit. Ut nonumy eos sit clita et nibh aliquam erat feugait dolor ipsum eros magna vulputate dolor gubergren sea. Sit sanctus sadipscing et et. Duo commodo duo takimata ut. Amet diam hendrerit ipsum diam justo ea et clita sit voluptua dolor amet lorem eum diam. Kasd ea vero. At sed sit justo consetetur duo dolor eum tempor nostrud consequat dolor eros amet. Minim magna consequat et at dolores dolor magna dolor rebum eos. Ipsum eos ut est dolores eleifend accusam. Praesent sadipscing nostrud eu dolores sit nonumy consetetur dolore dolor vel dolor.\n  Dolore velit no invidunt et nonummy volutpat nonumy illum et sit. Tempor lorem diam ipsum hendrerit iriure est diam. Facilisi elit ipsum consequat. Iusto magna ex vero assum amet dolor adipiscing. Labore tempor cum gubergren kasd vel kasd illum amet sed. Sed et iriure consetetur nonumy et lorem in esse sed sit no no iriure vel ut. Stet sed eros ullamcorper dolores lorem voluptua autem invidunt gubergren. Vero diam amet ipsum ullamcorper dolor volutpat ea dolor ad sed sadipscing. Sanctus lorem lorem consetetur lorem. Sed ipsum justo minim elit kasd nonummy et amet vero ut diam. Consetetur vero possim sed tincidunt et duo duo diam sed labore sed consectetuer consetetur rebum wisi tincidunt gubergren lorem.\n  Nobis et dolores tempor elitr erat diam diam. Justo nostrud stet dolor sea stet eros lorem rebum aliquam accusam autem. Invidunt vel labore takimata diam ea nisl sanctus kasd dolore stet esse diam diam et. Elitr sanctus et facilisis duo justo nulla velit facilisis option wisi et luptatum. Vero eu nisl sed amet blandit dolore sanctus consetetur est erat aliquyam dolor. Nam at vulputate et eos stet vero ea nulla at sanctus clita sed dolores tempor erat stet sadipscing et. Justo ipsum sed magna sed eirmod volutpat sadipscing. Tincidunt clita suscipit delenit amet consetetur duis quod clita takimata at. Suscipit wisi et stet placerat consetetur voluptua amet. Magna elitr lorem nonumy rebum. Volutpat accusam accusam magna nobis nostrud sit voluptua et wisi dolor sea nibh elitr illum. Lorem eu delenit sit nulla lorem. Rebum sea est aliquam.\n  Sed eos diam sea kasd eos. Aliquyam no laoreet commodo et rebum commodo adipiscing et dolor elitr tation. Dolor erat consequat et autem. Ipsum voluptua et stet dolore duis diam lorem stet at. Et blandit aliquip laoreet eros voluptua clita duis tempor. Ut stet lorem at dignissim lorem praesent te option magna dolor sea quod lorem sed kasd. Dolor kasd amet takimata ipsum aliquyam dolore magna labore voluptua voluptua. Dolores rebum dolor accusam dolor lorem et lorem nulla tempor eleifend stet. Feugait accumsan at invidunt molestie et ea labore eos iusto ut amet sed quod diam vero et sea dolore. Laoreet tincidunt est amet sed eu consetetur voluptua. Dolor vero sanctus duo accusam accusam volutpat nibh et kasd sit vero dolore sed lorem te lorem ullamcorper volutpat. Et et kasd in no dolore et eos dolores duis dolore elitr facilisi iusto consequat kasd molestie ipsum lorem. Sadipscing ipsum dolor sed ut enim wisi ut dolore ullamcorper rebum dolore dolore vero diam. Dolor sea labore diam nibh sea magna diam.\n  Clita sea ut et eos qui stet tempor vero. Consequat justo eirmod sea justo lorem nonummy dolor eos consectetuer eu vero sadipscing rebum labore. Sit ipsum vero sea sadipscing at dolore tempor at diam accusam et et erat lorem quis sadipscing enim. Sed elitr gubergren gubergren takimata wisi clita diam facilisis ea eirmod sea. Elit aliquyam odio erat aliquyam facilisi ipsum clita dolor stet dolores invidunt amet dolor eum dolore ad. Lorem nonumy et. Dolore et at et. Dolore consequat amet et molestie vel takimata magna in voluptua hendrerit elit est adipiscing lorem et duis lorem. Clita nobis voluptua amet nonummy at odio quis. Et diam dolores tempor lorem ut diam dolor amet illum commodo tempor possim consequat dolore erat. At vero erat elitr lobortis voluptua placerat dolor ipsum eirmod. Et volutpat ea aliquyam eirmod amet nonummy labore tempor accusam possim nonumy clita kasd. Eos sea aliquyam magna lorem velit accumsan sed facilisis diam vero magna sadipscing. Euismod dolor exerci sanctus tempor tempor commodo dolor nulla assum diam. Dolor eu no eos ipsum ipsum stet et ea iriure eleifend ipsum rebum est. Praesent et delenit dolor est sit gubergren sanctus sanctus lorem consectetuer erat ut no tempor ea ex labore. Invidunt sit at eirmod ipsum ea nulla at consetetur eirmod ut nihil ut aliquip.\n  , publishDate=2024-04-12T11:44:10.5052641+00:00)\nat VerifyPutBookAPITest.lambda$updateSingleFieldTest$1(VerifyPutBookAPITest.java:82)","time":{"start":1727783047512,"stop":1727783050581,"duration":3069}}]},"81b53c44a37a8dbbba9e3946f0b82567":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"32608891fe69555a","status":"passed","time":{"start":1727783096795,"stop":1727783097528,"duration":733}}]},"97fc866912ac373866526206518ec19c":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"55735f95f1325eae","status":"failed","statusDetails":"Cannot update book by negative Id expected [400] but found [200]","time":{"start":1727783041964,"stop":1727783042299,"duration":335}}]},"e475627d02d03d996c83c6b888c3324c":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"a51b235b0c964b34","status":"passed","time":{"start":1727783118569,"stop":1727783119549,"duration":980}}]},"5e0859fcc95757177d373aacdb49c3c":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"31ecbd9f11869571","status":"passed","time":{"start":1727783071055,"stop":1727783077096,"duration":6041}}]},"5218e0dfd9b169abf658e31edccff883":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"1c186e3e6bf64f2b","status":"passed","time":{"start":1727783057170,"stop":1727783063708,"duration":6538}}]},"7af5d3302c5b81e1fd19bf121b39d455":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"abe203c75552de0e","status":"failed","statusDetails":"Status Code should be equal to: 400 expected [400] but found [200]","time":{"start":1727783021464,"stop":1727783021833,"duration":369}}]},"167faba5613f00978cc22308217f98e1":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"1b4b3f44e6c3ae6e","status":"failed","statusDetails":"Cannot update author with negative  Book Id expected [400] but found [200]","time":{"start":1727783083568,"stop":1727783090069,"duration":6501}}]},"395bca8c891752656f62408e19d3edb8":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"a254eee56692158e","status":"failed","statusDetails":"Should not be able to create an author with negative Id expected [400] but found [200]","time":{"start":1727783051666,"stop":1727783052008,"duration":342}}]},"7b07daf3b08d0ad79f1730fd6b00b23e":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"84a20a83e7d9a30c","status":"failed","statusDetails":"Should not be able to create an author with negative Book Id expected [400] but found [200]","time":{"start":1727783051335,"stop":1727783051664,"duration":329}}]},"cf52bf2b4b27e45b04fcf9436b175001":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"2c66de8bad58ab9c","status":"passed","time":{"start":1727783030625,"stop":1727783032464,"duration":1839}}]},"6923b3b82dd8d5cd8463a743383d0d92":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"7ec3d9523166c96b","status":"failed","statusDetails":"Book shouldn't have empty fields expected [400] but found [200]","time":{"start":1727783021102,"stop":1727783021458,"duration":356}}]},"1592aac8c41f6b3b31832e6a42782c6":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"52e5e6c670f2e5fd","status":"failed","statusDetails":"Cannot delete author with negative Id expected [404] but found [200]","time":{"start":1727783118246,"stop":1727783118567,"duration":321}}]},"cfd7d67d41216c1aa104144d157139a7":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"efa6bc9b87e31d6a","status":"passed","time":{"start":1727783017801,"stop":1727783020664,"duration":2863}}]},"ef775bfc20750b32b9daec631a6fed30":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"71907d0b0166a0b3","status":"failed","statusDetails":"Cannot update author with negative Id expected [400] but found [200]","time":{"start":1727783090071,"stop":1727783096793,"duration":6722}}]},"a8ac916e4a73d86f1e0cc3424ec6f005":{"statistic":{"failed":0,"broken":0,"skipped":0,"passed":1,"unknown":0,"total":1},"items":[{"uid":"1fcde8d0fbb36fb1","status":"passed","time":{"start":1727783077098,"stop":1727783083222,"duration":6124}}]},"d63082dd515db857e51397c6bfc03565":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"3410d61e3b9a024d","status":"failed","statusDetails":"Author should be deleted expected [204] but found [200]","time":{"start":1727783111402,"stop":1727783118244,"duration":6842}}]},"a0f2f02bf8adb43505f3b98c2fda14d5":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"e9ea59165b359b0f","status":"failed","statusDetails":"Book doesn't exist expected [404] but found [200]","time":{"start":1727783045065,"stop":1727783047510,"duration":2445}}]},"e96e2ceedf8018a185cad870eb3f3768":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"1b299fd729a295c7","status":"failed","statusDetails":"Cannot update book with negative Id expected [400] but found [200]","time":{"start":1727783042301,"stop":1727783044395,"duration":2094}}]},"7f1cf4e694421a81d7a3af70e6c156ef":{"statistic":{"failed":1,"broken":0,"skipped":0,"passed":0,"unknown":0,"total":1},"items":[{"uid":"ccb4cf4fc9e30d52","status":"failed","statusDetails":"Cannot delete book with non-existent Id expected [404] but found [200]","time":{"start":1727783039768,"stop":1727783041962,"duration":2194}}]}}